---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisMode.BuildingElements
enum: Autodesk.Revit.DB.Analysis.AnalysisMode
source: html/a4d5128f-91e8-06f4-c5c5-72ba0f705a48.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisMode.BuildingElements

Energy Analysis Model based on building elements.